# ch03. 函数的语法



## 3.1 模式匹配

```haskell
-- 模式匹配
lucky :: (Integral a) => a -> String
lucky 7 = "LUCKY NUMBERS SEVEN."
lucky x = "Sorry, you are out of lucky."

GHCI> lucky 8
"Sorry, you are out of lucky."
GHCI> lucky 7
"LUCKY NUMBERS SEVEN."
GHCI> :t lucky
lucky :: Integral a => a -> String
```

> 类似函数重载、策略模式



1. 对输入数字非 1-5 作区分

   ```haskell
   sayMe :: (Integral a) => a -> String  
   sayMe 1 = "One!"  
   sayMe 2 = "Two!"  
   sayMe 3 = "Three!"  
   sayMe 4 = "Four!"  
   sayMe 5 = "Five!"  
   sayMe x = "Not between 1 and 5"
   
   GHCI> :t sayMe
   sayMe :: Integral a => a -> String
   ```

   当然有模式匹配不到的情况

   ```haskell
   GHCI> sayMe "asd"
   <interactive>:28:1: error:
       Variable not in scope: sayMe :: [Char] -> t
   ```

   

2. 两个向量相加

   ```haskell
   addVectors :: (Num n) => (n, n) -> (n, n) -> (n, n)
   addVectors (a, b) (c, d) = (a+c, b+d)
   
   addVectors' :: (Num n) => (n, n) -> (n, n) -> (n, n)
   addVectors' a b = (fst a + fst b, snd a + snd b)
   -- 并不好用，无法解决三元组
   ```

   

3. 来个阶乘递归

   ```haskell
   -- 递归
   factorial :: (Integral a) => a -> a
   factorial 0 = 1 -- 先捕获0，作为终止条件
   factorial n = n * factorial(n-1)
   ```



### 对 List 使用模式匹配

>  \`x:xs\`  = [x, xs]

1. 创建函数：模拟一个 head

   ```haskell
   head' :: [a] -> a
   head' [] = error "you can't get first item from empty list."
   head' (x:_) = x -- _起到 ...rest 作用
   
   GHCI> head' [1,2,3]
   1
   GHCI> head' "123"
   '1'
   GHCI> head' []
   *** Exception: you can't get first item from empty list.
   CallStack (from HasCallStack):
     error, called at baby.hs:60:12 in main:Main
   ```

   

2. 创建函数：展示 List 前 n 项

   ```haskell
   tell :: (Show l) => [l] -> String
   tell [] = error "the list is empty."
   tell (x:[]) = "The list has one element " ++ show x
   tell (x:y:[]) = "The list has two elements " ++ show x ++ " and " ++ show y
   tell (x:y:_) = "The list is long. The first two elements are " ++ show x ++ " and " ++ show y
   
   GHCI> tell [1,2,3]
   "The list is long. The first two elements are 1 and 2"
   GHCI> tell [1,2]
   "The list has two elements 1 and 2"
   GHCI> tell [1]
   "The list has one element 1"
   ```

   > 函数重载 太棒了！

3. 





